### Dividir (split) string por um separador
https://pandas.pydata.org/docs/reference/api/pandas.Series.str.split.html

https://pandas.pydata.org/docs/reference/api/pandas.Series.str.rsplit.html

In [10]:
import pandas as pd

In [11]:
# relembrando no python
a = 'pyladies salvador'

In [12]:
a

'pyladies salvador'

In [13]:
a.split()

['pyladies', 'salvador']

In [15]:
a.split()[1]

'salvador'

#### dividir stings de uma colouna no pandas usando o método str.split()

In [16]:
df = pd.DataFrame({
    'nome':['Joana Silva', 'andreA saNtos', 'LeIla BarbOsa'],
    'data_nascimento':['01/04/2001', '05/06/1996', '15/10/1987'],
    'sexo':['feminino', '  feminino', ' feminino  '],
    'cpf':['093.434.324-16', '125.789.674-64', '154.849.764-64']
})
df

            nome data_nascimento         sexo             cpf
0    Joana Silva      01/04/2001     feminino  093.434.324-16
1  andreA saNtos      05/06/1996     feminino  125.789.674-64
2  LeIla BarbOsa      15/10/1987   feminino    154.849.764-64

In [18]:
df['teste'] = df['nome'].str.split()
df

,nome,data_nascimento,sexo,cpf,teste
0,Joana Silva,01/04/2001,feminino,093.434.324-16,"[Joana, Silva]"
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,"[andreA, saNtos]"
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,"[LeIla, BarbOsa]"

In [19]:
df['primeiro_nome'] = df['nome'].str.split().str[0]
df

,nome,data_nascimento,sexo,cpf,teste,primeiro_nome
0,Joana Silva,01/04/2001,feminino,093.434.324-16,"[Joana, Silva]",Joana
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,"[andreA, saNtos]",andreA
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,"[LeIla, BarbOsa]",LeIla

In [20]:
df['nome'].str.split(expand = True)

        0        1
0   Joana    Silva
1  andreA   saNtos
2   LeIla  BarbOsa

In [21]:
df[['primeiro_nome','sobrenome']] = df['nome'].str.split(expand = True)
df

,nome,data_nascimento,sexo,cpf,teste,primeiro_nome,sobrenome
0,Joana Silva,01/04/2001,feminino,093.434.324-16,"[Joana, Silva]",Joana,Silva
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,"[andreA, saNtos]",andreA,saNtos
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,"[LeIla, BarbOsa]",LeIla,BarbOsa

In [22]:
df['data_nascimento'].str.split()

0    [01/04/2001]
1    [05/06/1996]
2    [15/10/1987]
Name: data_nascimento, dtype: object

In [23]:
df['data_nascimento'].str.split('/')

0    [01, 04, 2001]
1    [05, 06, 1996]
2    [15, 10, 1987]
Name: data_nascimento, dtype: object

In [24]:
df['data_nascimento'].str.split('/', n = 1)

0    [01, 04/2001]
1    [05, 06/1996]
2    [15, 10/1987]
Name: data_nascimento, dtype: object

In [25]:
df['data_nascimento'].str.rsplit('/', n = 1)

0    [01/04, 2001]
1    [05/06, 1996]
2    [15/10, 1987]
Name: data_nascimento, dtype: object

In [26]:
df['data_nascimento'].str.split('/', expand = True, n = 1)

    0        1
0  01  04/2001
1  05  06/1996
2  15  10/1987

In [28]:
df['mês_ano'] = df['data_nascimento'].str.split('/', expand = True, n =1)[1]
df

,nome,data_nascimento,sexo,cpf,teste,primeiro_nome,sobrenome,mês_ano
0,Joana Silva,01/04/2001,feminino,093.434.324-16,"[Joana, Silva]",Joana,Silva,04/2001
1,andreA saNtos,05/06/1996,feminino,125.789.674-64,"[andreA, saNtos]",andreA,saNtos,06/1996
2,LeIla BarbOsa,15/10/1987,feminino,154.849.764-64,"[LeIla, BarbOsa]",LeIla,BarbOsa,10/1987

In [29]:
df['data_nascimento'].str.split('/', n =1).str[1]

0    04/2001
1    06/1996
2    10/1987
Name: data_nascimento, dtype: object

In [30]:
df['data_nascimento'].str.split('/', expand = True, n =1)[1]

0    04/2001
1    06/1996
2    10/1987
Name: 1, dtype: object